GG_clone_backend/app/controllers/api/v1/drivers_controller.rb

SELECT "drivers".* FROM "drivers"
---
  def index
    @users = Driver.all

SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = Driver.find(params[:id])

INSERT INTO "drivers" ("first_name", "last_name", "phone_number", "email", "car_manufacturer", "car_model", "car_registration_number", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = Driver.new(user_params)
    if @user.save