GG_clone_backend/app/controllers/api/v1/super_users_controller.rb

  def index
    @users = SuperUser.all
---
SELECT "super_users".* FROM "super_users"

  def show
    @user = SuperUser.find(params[:id])
---
SELECT "super_users".* FROM "super_users" WHERE "super_users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    @user = SuperUser.new(user_params)
    if @user.save
---
INSERT INTO "super_users" ("phone_number", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = SuperUser.find(params[:id])
    if current_user?(@user, 'SuperUser')
      if @user.update(user_params)
---
SELECT "super_users".* FROM "super_users" WHERE "super_users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "super_users" SET "first_name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "super_users"."id" = ?  [["first_name", "ArtyomKosakyan"], ["password_digest", "$2a$12$5lSgCY3SmCDBfXs6Zni1Yu1XPQm/gcFNW7FIfzot1t2/8WZhAJDeq"], ["updated_at", "2021-04-26 13:46:02.940404"], ["id", 6]]